<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [12]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [8]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.19.2
Pandas:  1.1.3

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [3]:
# wrong:
bikes = pd.read_table('dat/bikeshare.csv', header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('dat/bikeshare.csv', header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('dat/bikeshare.csv', header = 0)
print(bikes.head())

FileNotFoundError: [Errno 2] No such file or directory: 'dat/bikeshare.csv'

?:
ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [3]:
#ANSWER:
bikes = pd.read_table('E:/IOD_data/bikeshare.csv', header = 0, sep = ',')
print(bikes.head())
print(type(bikes))

   instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  \
0        1  2011-01-01       1   0     1   0        0        6           0
1        2  2011-01-01       1   0     1   1        0        6           0
2        3  2011-01-01       1   0     1   2        0        6           0
3        4  2011-01-01       1   0     1   3        0        6           0
4        5  2011-01-01       1   0     1   4        0        6           0

   weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0           1  0.24  0.2879  0.81        0.0       3          13   16
1           1  0.22  0.2727  0.80        0.0       8          32   40
2           1  0.22  0.2727  0.80        0.0       5          27   32
3           1  0.24  0.2879  0.75        0.0       3          10   13
4           1  0.24  0.2879  0.75        0.0       0           1    1
<class 'pandas.core.frame.DataFrame'>

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [9]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [11]:
df = pd.read_excel('E:/IOD_data/Iris.xls', sheet_name = 'Data', header = 0)
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
...,...,...,...,...,...,...
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For ecxample, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

### Answer


Marchia --> After checking the excel file using the formula auditing function in excel I was not able to find any aggregates. Have loaded the table as follows

In [12]:
df = pd.read_excel('E:/IOD_data/Iris.xls', sheet_name = 'Data', header = 0)
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
...,...,...,...,...,...,...
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [17]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

Empty DataFrame
Columns: [time, latitude, longitude, depth, mag, magType, nst, gap, dmin, rms, net, id, updated, place, type, horizontalError, depthError, magError, magNst, status, locationSource, magSource]
Index: []

[0 rows x 22 columns]

In [ ]:
# trying out one with solar fare data from UCI library

In [3]:
df2 = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/solar-flare/flare.data1')
df2

    *******DATA1; 1969 FLARE DATA  (02/13/69 to 03/27/69) *******
0                            C S O 1 2 1 1 2 1 2 0 0 0
1                            D S O 1 3 1 1 2 1 2 0 0 0
2                            C S O 1 3 1 1 2 1 1 0 0 0
3                            D S O 1 3 1 1 2 1 2 0 0 0
4                            D A O 1 3 1 1 2 1 2 0 0 0
..                                                 ...
318                          C R O 1 2 1 2 2 1 2 0 0 0
319                          D R O 1 3 1 1 2 1 2 0 0 0
320                          E A O 1 3 1 1 2 1 2 0 0 0
321                          C R O 1 3 1 1 2 1 1 0 0 0
322                          E K C 1 3 1 1 2 2 2 0 2 0

[323 rows x 1 columns]

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [4]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'
df = pd.read_html(url)
df

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [5]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [7]:
#ANSWER 
bikes.info
# 17 columns, 17379 rows

<bound method DataFrame.info of        instant      dteday  season  yr  mnth  hr  holiday  weekday  \
0            1  2011-01-01       1   0     1   0        0        6
1            2  2011-01-01       1   0     1   1        0        6
2            3  2011-01-01       1   0     1   2        0        6
3            4  2011-01-01       1   0     1   3        0        6
4            5  2011-01-01       1   0     1   4        0        6
...        ...         ...     ...  ..   ...  ..      ...      ...
17374    17375  2012-12-31       1   1    12  19        0        1
17375    17376  2012-12-31       1   1    12  20        0        1
17376    17377  2012-12-31       1   1    12  21        0        1
17377    17378  2012-12-31       1   1    12  22        0        1
17378    17379  2012-12-31       1   1    12  23        0        1

       workingday  weathersit  temp   atemp   hum  windspeed  casual  \
0               0           1  0.24  0.2879  0.81     0.0000       3
1               0           1  0.22  0.2727  0.80     0.0000       8
2               0           1  0.22  0.2727  0.80     0.0000       5
3               0           1  0.24  0.2879  0.75     0.0000       3
4               0           1  0.24  0.2879  0.75     0.0000       0
...           ...         ...   ...     ...   ...        ...     ...
17374           1           2  0.26  0.2576  0.60     0.1642      11
17375           1           2  0.26  0.2576  0.60     0.1642       8
17376           1           1  0.26  0.2576  0.60     0.1642       7
17377           1           1  0.26  0.2727  0.56     0.1343      13
17378           1           1  0.26  0.2727  0.65     0.1343      12

       registered  cnt
0              13   16
1              32   40
2              27   32
3              10   13
4               1    1
...           ...  ...
17374         108  119
17375          81   89
17376          83   90
17377          48   61
17378          37   49

[17379 rows x 17 columns]>

What are the column names in `bikes`?

In [14]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [12]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

In [15]:
#ANSWER
bikes.index

# index has been automatically generated in the first column of the dataframe
bikes.iloc[:,0]

0            1
1            2
2            3
3            4
4            5
         ...
17374    17375
17375    17376
17376    17377
17377    17378
17378    17379
Name: instant, Length: 17379, dtype: int64

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [16]:
#ANSWER
bikes['season']

0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64

In [17]:
bikes[['season']]

       season
0           1
1           1
2           1
3           1
4           1
...       ...
17374       1
17375       1
17376       1
17377       1
17378       1

[17379 rows x 1 columns]

How would we use object notation to show the first 4 rows of `atemp`?

In [20]:
#ANSWER
bikes.iloc[0:5,:]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [23]:
bikes[[0]]
bikes[0]
bikes[0,0]
bikes[[0,0]]

KeyError: "None of [Int64Index([0], dtype='int64')] are in the [columns]"

What is the correct way to access the 1st row of the DataFrame by its index?

In [26]:
#ANSWER
bikes.iloc[0]

instant                1
dteday        2011-01-01
season                 1
yr                     0
mnth                   1
hr                     0
holiday                0
weekday                6
workingday             0
weathersit             1
temp                0.24
atemp             0.2879
hum                 0.81
windspeed              0
casual                 3
registered            13
cnt                   16
Name: 0, dtype: object

What is the correct way to access the 2nd column of the DataFrame by its index?

In [27]:
#ANSWER
bikes.iloc[:,1]

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
            ...
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

## Handling Missing Values

What is the Pandas `isnull` function for?


ANSWER: Return true if a null value is found within a dataframe. Returns false if not null

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [28]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [33]:
#ANSWER
bikes.isnull().sum().sum()

0

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [34]:
#ANSWER
bikes.isnull().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

What is the Numpy object `nan` used for? (Write a descriptive answer.)


ANSWER: Marking a data point as invalid. Data comes with empty values, which if left alone, will cause errors in the analysis that  will be performed on the dataset. To avoid this, NaN is used as a standard value that indicates that there is a missing floating point value. As it is standardised, everyone is able to udnerstand what NaN signifies

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [35]:
#ANSWER
def div_func():
    div_result = None
    num_list = []
    user_active = True
    while user_active == True:
        num = input("Please enter a number and enter s to stop. A min of 2 numbers are required : ")
        if num == 's':
            if len(num_list) < 2:
                continue
            break
        else:
            num_list.append(int(num))
    
    for i in range(len(num_list)):
 
        try:
            if i == 0:
                div_result = num_list[i]
            else:
                div_result = div_result / num_list[i]

        except: 
            div_result = np.nan
            print("The division of the inputted numbers is not valid")
            
            
    return div_result

In [37]:
div_func()

Please enter a number and enter s to stop. A min of 2 numbers are required : 1
Please enter a number and enter s to stop. A min of 2 numbers are required : 0
Please enter a number and enter s to stop. A min of 2 numbers are required : s
The division of the inputted numbers is not valid

nan

Apply the Pandas `isna` function to the following data objects:

In [35]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [47]:
# Answer for x
x_array = [x]
df_x = pd.DataFrame(data = x_array)
df_x.isna()

       0
0  False

In [48]:
# Answer for y
y_array = [y]
df_y = pd.DataFrame(data = y_array)
df_y.isna()

      0
0  True

In [37]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [52]:
#ANSWER
df = pd.DataFrame(data = array)
df.isna()

       0      1      2
0  False   True  False
1  False  False   True

How is the pandas I/O parameter `na_values` used?

ANSWER: na_values is parameter used in the pd.read_csv method. The value given to this parameter helps pandas understand what values are considered NaN values. This is used as for some values, pandas interprets them as strings, where instead we want it to be interpreted a NaN value. <br>

For example, a dataframe can contain the value "Not Available". This is interpreted as a string and not a NaN value. By doing:

In [53]:
 # df = pd.read_csv('Example.csv',  na_values = "not available")

pandas will now recognise Not available as a NaN value

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [6]:
#ANSWER
bikes['season'].value_counts()

3    4496
2    4409
1    4242
4    4232
Name: season, dtype: int64

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [16]:
#ANSWER

print(f"Range of the instant column is {bikes['instant'].min()} to {bikes['instant'].max()}")
print(f"Range of the dteday column is {bikes['dteday'].min()} to {bikes['dteday'].max()}")
print(f"Range of the instant column is {bikes['windspeed'].min()} to {bikes['windspeed'].max()}")

Range of the instant column is 1 to 17379
Range of the dteday column is 2011-01-01 to 2012-12-31
Range of the instant column is 0.0 to 0.8507

Compute and print the overall minimum and maximum of the numeric data columns:

In [29]:
bikes_min, bikes_max = (min(bikes.min()), max(bikes.max()))
bikes_min, bikes_max

# running the code above generates an error where > is not supported between instances od the ndarray and str

TypeError: '>' not supported between instances of 'numpy.ndarray' and 'str'

In [56]:
# after checking the cause of the above error, found out that the dteday is not numerical, therefore dropping the column 
bikes_min = bikes.min()
bikes_min = bikes_min.drop(labels=['dteday'])
print(f"The min of all numerical columns is {min(bikes_min)}")

# doing the same for max

bikes_max = bikes.max()
bikes_max = bikes_max.drop(labels=['dteday'])
print(f"The max of all numerical columns is {max(bikes_max)}")

The min of all numerical columns is 0
The max of all numerical columns is 17379

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [57]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [63]:
#ANSWER
bikes['atemp'].quantile([0.1,0.25,0.5,0.75,0.9])

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [64]:
type(bikes['atemp'])

pandas.core.series.Series

In [65]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
9637,9638,2012-02-11,1,1,2,12,0,6,0,2,0.26,0.2576,0.81,0.1642,25,196,221
2389,2390,2011-04-14,2,0,4,11,0,4,1,1,0.52,0.5000,0.45,0.1642,28,87,115
15553,15554,2012-10-15,4,1,10,6,0,1,1,2,0.56,0.5303,0.73,0.2985,6,141,147
1918,1919,2011-03-25,2,0,3,17,0,5,1,2,0.32,0.2879,0.36,0.3582,23,202,225
1291,1292,2011-02-26,1,0,2,23,0,6,0,1,0.28,0.2576,0.75,0.2836,5,29,34

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [66]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)

What is `atemp_level`?

In [72]:
#ANSWER : Atemp level comprises of 4 groups which are based from atemp.
# groups were populated based on the ranges that were automatically generated based on the number of bins
atemp_level

0        (0.25, 0.5]
1        (0.25, 0.5]
2        (0.25, 0.5]
3        (0.25, 0.5]
4        (0.25, 0.5]
            ...
17374    (0.25, 0.5]
17375    (0.25, 0.5]
17376    (0.25, 0.5]
17377    (0.25, 0.5]
17378    (0.25, 0.5]
Name: atemp, Length: 17379, dtype: category
Categories (4, interval[float64]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

Here is a random sample of `atemp_level`:

In [73]:
atemp_level.sample(5)

5532     (0.5, 0.75]
14214    (0.5, 0.75]
15505    (0.25, 0.5]
14770    (0.5, 0.75]
9855     (0.25, 0.5]
Name: atemp, dtype: category
Categories (4, interval[float64]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [74]:
atemp_level = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

17366    cool
16804    mild
4827     warm
14239    warm
556      cool
Name: atemp, dtype: category
Categories (4, object): ['cool' < 'mild' < 'warm' < 'hot']

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [116]:
#ANSWER

# adding the atemp_level into the bikes dataframe
bikes['atemp_level'] = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])

# creating a dataframe where season is 2 and atemp_level is mild
bikes_season_2 = bikes.loc[(bikes['season'] == 2) & (bikes['atemp_level'] == 'mild')]

#getting the mild entries by doing a simple count on the dataframe
bikes_season_2['atemp_level'].count()

1829

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [136]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )

In [147]:
# Cleaning Data
print(a.shape)
print(a)
print("a has an array of 3 zeroes")
print('\n')
print(b.shape)
print(b)
print("b has an array within an array which contains 3 1's")
print('\n')
print(c.shape)
print(c)
print("c is a 3 dimensional array, where the 2 arrays at the highest level arrays each containg a 3 x 4 matrix")
print('\n')
print(d.shape)
print(d)
print("d has an array contain values from 0 to 3")
print('\n')
print(e.shape)
print(e)
print("e is a 2 dimensional array, with the highest level array containing a 1x4 matrix")

(3,)
[0. 0. 0.]
a has an array of 3 zeroes


(1, 3)
[[1. 1. 1.]]
b has an array within an array which contains 3 1's


(2, 3, 4)
[[[1 4 1 8]
  [2 7 3 7]
  [6 7 9 9]]

 [[9 1 4 1]
  [9 3 6 3]
  [8 2 8 9]]]
c is a 3 dimensional array, where the 2 arrays at the highest level arrays each containg a 3 x 4 matrix


(4,)
[0 1 2 3]
d has an array contain values from 0 to 3


(2, 4)
[[1 2 3 4]
 [5 6 7 8]]
e is a 2 dimensional array, with the highest level array containing a 1x4 matrix

## Load Data

Load rock.csv and clean the dataset.

In [125]:
import pandas as pd
import numpy as np

In [126]:
rock_df = pd.read_csv("E:/IOD_data/rock.csv", sep = ',')

## Check Column Names

Check column names and clean.

In [127]:
# before columns were cleaned
rock_df.sample(10)

,Song Clean,ARTIST CLEAN,Release Year,COMBINED,First?,Year?,PlayCount,F*G
1893,Rockin' Down The Highway,The Doobie Brothers,1972,Rockin' Down The Highway by The Doobie Brothers,1,1,13,13
734,Save Your Love,Great White,NaN,Save Your Love by Great White,1,0,1,0
2006,Behind Blue Eyes,The Who,1971,Behind Blue Eyes by The Who,1,1,75,75
2094,I Still Haven't Found What I'm Looking For,U2,1987,I Still Haven't Found What I'm Looking For by U2,1,1,53,53
580,Let It Grow,Eric Clapton,1974,Let It Grow by Eric Clapton,1,1,4,4
1823,Sun King,The Beatles,1969,Sun King by The Beatles,1,1,1,1
1148,What Do All The People Know,Monroes,NaN,What Do All The People Know by Monroes,1,0,2,0
2068,You Don't Know How It Feels,Tom Petty & The Heartbreakers,1994,You Don't Know How It Feels by Tom Petty & The...,1,1,31,31
267,More Than a Feeling,Boston,1976,More Than a Feeling by Boston,1,1,134,134
1995,Handle with Care,The Traveling Wilburys,1988,Handle with Care by The Traveling Wilburys,1,1,5,5

In [128]:
# cleaning only the column names
rock_df =rock_df.rename(columns={'Song Clean' : 'Song', 'ARTIST CLEAN' : 'Artist', 'Year?':'Year exist?', 'F*G':'Plays in release year'})
rock_df.head()

,Song,Artist,Release Year,COMBINED,First?,Year exist?,PlayCount,Plays in release year
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

# Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [129]:
null_mask = rock_df['Release Year'].isnull()
rock_df.loc[null_mask, 'Release Year'] = 0
rock_df

,Song,Artist,Release Year,COMBINED,First?,Year exist?,PlayCount,Plays in release year
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,0,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1
...,...,...,...,...,...,...,...,...
2225,She Loves My Automobile,ZZ Top,0,She Loves My Automobile by ZZ Top,1,0,1,0
2226,Tube Snake Boogie,ZZ Top,1981,Tube Snake Boogie by ZZ Top,1,1,32,32
2227,Tush,ZZ Top,1975,Tush by ZZ Top,1,1,109,109
2228,TV Dinners,ZZ Top,1983,TV Dinners by ZZ Top,1,1,1,1
2229,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO,ZZ Top,1973,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2

# Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [130]:

rock_df.iloc[1504,2] = '1972'

In [131]:
# Release year should be int
rock_df.dtypes

Song                     object
Artist                   object
Release Year             object
COMBINED                 object
First?                    int64
Year exist?               int64
PlayCount                 int64
Plays in release year     int64
dtype: object

In [132]:
# extracting the release year column
ry_object = rock_df['Release Year']
# changing the column to int
ry_int = pd.to_numeric(ry_object)
# replacing the column in the rock dataframe
rock_df['Release Year'] = ry_int
# rechecking
rock_df.dtypes

Song                     object
Artist                   object
Release Year              int64
COMBINED                 object
First?                    int64
Year exist?               int64
PlayCount                 int64
Plays in release year     int64
dtype: object

# Check Min, Max of Each Column

Is there any illogical value in any column? How can we fix that?

Marchia - When performing the to_numeric function found that a word was used as a release year. This was solved before the conversion to int

In [133]:
# checking max - no errors
rock_df.max()

Song                                    Ziggy Stardust
Artist                                            a-ha
Release Year                                      2014
COMBINED                 Ziggy Stardust by David Bowie
First?                                               1
Year exist?                                          1
PlayCount                                          142
Plays in release year                              142
dtype: object

In [134]:
# checking min - no errors
rock_df.min()

Song                                    #9 Dream
Artist                               .38 Special
Release Year                                   0
COMBINED                 #9 Dream by John Lennon
First?                                         1
Year exist?                                    0
PlayCount                                      0
Plays in release year                          0
dtype: object

# Write Some Functions

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [135]:
df = pd.DataFrame(columns = ["Song & Artist", "<1970"])
def my_func1(rock):
    SA_list = []
    RY_list = []
    for index, row in rock.iterrows():
        SA_list.append(rock.iloc[index,3])
        RY_list.append(rock.iloc[index,2] < 1970)
        
    df = pd.DataFrame(columns = ["Song & Artist", "<1970"])
    df["Song & Artist"] = pd.Series(SA_list)
    df["<1970"] = pd.Series(RY_list)
    
    return df

## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [139]:
def my_func2(rock):
    col_list  = rock_df.columns
    rock_2 = pd.DataFrame(columns = col_list)
    for i in my_list:
        try:
            x = pd.to_numeric(rock[i], downcast='float')
            rock_2[i] = x
        except:
            print(f"{i} cannot be converted to float")
            rock_2[i] = np.nan
    return rock_2

## Apply these functions to your dataset

Testing function 1 which will return song artist and a boolean value on whether release yeear is < 1970

In [144]:
rock_func_1 = my_func1(rock_df)
rock_func_1

                                          Song & Artist  <1970
0                       Caught Up in You by .38 Special  False
1                           Fantasy Girl by .38 Special   True
2                        Hold On Loosely by .38 Special  False
3                 Rockin' Into the Night by .38 Special  False
4                             Art For Arts Sake by 10cc  False
...                                                 ...    ...
2225                  She Loves My Automobile by ZZ Top   True
2226                        Tube Snake Boogie by ZZ Top  False
2227                                     Tush by ZZ Top  False
2228                               TV Dinners by ZZ Top  False
2229  WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...  False

[2230 rows x 2 columns]

Testing function 2 which creates a dataframe with only float. If column cannot be convereted to float, then it will be replaced with NaN

In [147]:
rock_func_2 = my_func2(rock_df)
rock_func_2

Song cannot be converted to float
Artist cannot be converted to float
COMBINED cannot be converted to float

,Song,Artist,Release Year,COMBINED,First?,Year exist?,PlayCount,Plays in release year
0,NaN,NaN,1982.0,NaN,1.0,1.0,82.0,82.0
1,NaN,NaN,0.0,NaN,1.0,0.0,3.0,0.0
2,NaN,NaN,1981.0,NaN,1.0,1.0,85.0,85.0
3,NaN,NaN,1980.0,NaN,1.0,1.0,18.0,18.0
4,NaN,NaN,1975.0,NaN,1.0,1.0,1.0,1.0
...,...,...,...,...,...,...,...,...
2225,NaN,NaN,0.0,NaN,1.0,0.0,1.0,0.0
2226,NaN,NaN,1981.0,NaN,1.0,1.0,32.0,32.0
2227,NaN,NaN,1975.0,NaN,1.0,1.0,109.0,109.0
2228,NaN,NaN,1983.0,NaN,1.0,1.0,1.0,1.0
2229,NaN,NaN,1973.0,NaN,1.0,1.0,2.0,2.0

In [149]:
rock_func_2.dtypes

Song                     float64
Artist                   float64
Release Year             float32
COMBINED                 float64
First?                   float32
Year exist?              float32
PlayCount                float32
Plays in release year    float32
dtype: object

## Describe the new float-only DataFrame.

Dataframe now only contains data for release year, first, year exist, playcount and plays in release year <br>
As the song, artist and combined are columns that are of string datatype, it is now replaced with NaN. However the datatype of the column is now also float



> 
>
>

>

>

>



---



---



> > > > > > > > > © 2019 Institute of Data


---



---